emacs/.config/emacs/setup/config.org
* Enable Line Numbers

#+begin_src emacs-lisp

    (global-display-line-numbers-mode 1)
    (setq display-line-numbers-type 'relative)
    (global-display-line-numbers-mode 1)

    (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () 
                    (menu-bar--display-line-numbers-mode-visual))))

#+end_src

* Hide  Line Numbers

#+begin_src emacs-lisp

  (dolist (mode '(term-mode-hook
                  eshell-mode-hook
                  shell-mode-hook
                  neotree-mode-hook
                  dired-mode-hook
                  vterm-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

* Column Number

#+begin_src emacs-lisp

  (column-number-mode)

#+end_src

* Disable UI elements of emacs GUI

#+begin_src emacs-lisp

  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

#+end_src

* Don't show splash screen on Startup

#+begin_src emacs-lisp

  (setq inhibit-startup-screen t)

#+end_src

* Disable Bell Ring

#+begin_src emacs-lisp

  (setq ring-bell-function 'ignore)

#+end_src

* Disable Saving Lock Files
#+begin_src emacs-lisp

  (add-hook 'after-init-hook (lambda () (setq-default create-lockfiles nil)))

#+end_src

* Change The Backup files location

#+begin_src emacs-lisp

  (setq backup-directory-alist '(("." . "~/.cache/emacs-backup-files"))
        backup-by-copying t    ; Don't delink hardlinks
        version-control t      ; Use version numbers on backups
        delete-old-versions t  ; Automatically delete excess backups
        kept-new-versions 20   ; how many of the newest versions to keep
        kept-old-versions 5    ; and how many of the old
        )

#+end_src

* Searching

#+BEGIN_SRC emacs-lisp

  (setq search-whitespace-regexp ".*")

#+END_SRC

* Enable SpellCheck

#+begin_src emacs-lisp

  (add-hook 'org-mode-hook (lambda () (flyspell-mode 1)))

#+end_src

* Enable Auto Pairing

#+begin_src emacs-lisp

  (dolist (mode '(emacs-lisp-mode
                  lisp-mode
                  javascript-mode
                  html-mode))
    (add-hook mode (lambda () ((electric-pair-mode 1)))))

#+end_src

* Hide Minor Modes list in Mode line

#+begin_src emacs-lisp

  (defun modeline-set-lighter (minor-mode lighter)
    (when (assq minor-mode minor-mode-alist)
      (setcar (cdr (assq minor-mode minor-mode-alist)) lighter)))

  (defun modeline-remove-lighter (minor-mode)
    (modeline-set-lighter minor-mode ""))

  (modeline-remove-lighter 'global-undo-tree-mode)
  (modeline-remove-lighter 'undo-tree-mode)
  (modeline-remove-lighter 'org-roam-ui-mode)
  (modeline-remove-lighter 'ivy-posframe-mode)
  (modeline-remove-lighter 'company-mode)
  (modeline-remove-lighter 'ivy-mode)
  (modeline-remove-lighter 'flyspell-mode)
  (modeline-remove-lighter 'buffer-face-mode)
  (modeline-remove-lighter 'org-table-header-line-mode)

#+end_src

* Disable Line Wrap

#+begin_src emacs-lisp

  ;; solution 1
  ;; (add-hook 'after-change-major-mode-hook (lambda () (toggle-truncate-lines t))) 

  ;; solution 2
  ;; (setq-default word-wrap t)

  ;; solution 3
  (add-hook 'org-mode-hook 'visual-line-mode)

#+end_src

